In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('../../Data/FuentesOriginales/USAR/3.0.Madrid_poblacion_total.csv', delimiter=';')
df.head(5)

,fecha,cod_municipio,municipio,cod_distrito,distrito,cod_barrio,barrio,num_personas,num_personas_hombres,num_personas_mujeres
0,1 de enero de 2021,28079,Madrid,01,Centro,01,Centro,141.236,71.881,69.355
1,1 de enero de 2021,28079,Madrid,02,Arganzuela,02,Arganzuela,154.243,72.000,82.243
2,1 de enero de 2021,28079,Madrid,03,Retiro,03,Retiro,118.557,53.800,64.757
3,1 de enero de 2021,28079,Madrid,04,Salamanca,04,Salamanca,146.016,64.540,81.476
4,1 de enero de 2021,28079,Madrid,05,Chamartín,05,Chamartín,145.700,65.599,80.101

In [3]:
df.describe()

       cod_municipio
count          612.0
mean         28079.0
std              0.0
min          28079.0
25%          28079.0
50%          28079.0
75%          28079.0
max          28079.0

In [4]:
df.shape

(612, 10)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 612 entries, 0 to 611
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fecha                 612 non-null    object
 1   cod_municipio         612 non-null    int64
 2   municipio             612 non-null    object
 3   cod_distrito          612 non-null    object
 4   distrito              612 non-null    object
 5   cod_barrio            612 non-null    object
 6   barrio                612 non-null    object
 7   num_personas          612 non-null    object
 8   num_personas_hombres  612 non-null    object
 9   num_personas_mujeres  612 non-null    object
dtypes: int64(1), object(9)
memory usage: 26.4+ KB

In [6]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
cod_municipio,612.0,28079.0,0.0,28079.0,28079.0,28079.0,28079.0,28079.0

In [7]:
df.dtypes

fecha                   object
cod_municipio            int64
municipio               object
cod_distrito            object
distrito                object
cod_barrio              object
barrio                  object
num_personas            object
num_personas_hombres    object
num_personas_mujeres    object
dtype: object

In [8]:
df.columns

Index(['fecha', 'cod_municipio', 'municipio', 'cod_distrito', 'distrito',
       'cod_barrio', 'barrio', 'num_personas', 'num_personas_hombres',
       'num_personas_mujeres'],
      dtype='object')

In [9]:
df.isnull().sum().values

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0], dtype=int64)

In [10]:
df.isnull()

,fecha,cod_municipio,municipio,cod_distrito,distrito,cod_barrio,barrio,num_personas,num_personas_hombres,num_personas_mujeres
0,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...
607,False,False,False,False,False,False,False,False,False,False
608,False,False,False,False,False,False,False,False,False,False
609,False,False,False,False,False,False,False,False,False,False
610,False,False,False,False,False,False,False,False,False,False
611,False,False,False,False,False,False,False,False,False,False

In [11]:
df.isnull().sum()

fecha                   0
cod_municipio           0
municipio               0
cod_distrito            0
distrito                0
cod_barrio              0
barrio                  0
num_personas            0
num_personas_hombres    0
num_personas_mujeres    0
dtype: int64